zero-downtime-unicorn-deploys-are-broken-with-postgresql.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zero-downtime Unicorn deploys are broken with PostgreSQL</title>
<!-- 2013-12-06 Fri 23:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Yuri Niyazov"/>
</head>
<body>
<div id="content">
<h1 class="title">Zero-downtime Unicorn deploys are broken with PostgreSQL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Disclaimer</a></li>
<li><a href="#sec-2">2. Introduction</a></li>
<li><a href="#sec-3">3. The Ruby PostgreSQL gem change</a></li>
<li><a href="#sec-4">4. Unicorn signals</a></li>
<li><a href="#sec-5">5. Unicorn and PostgreSQL</a></li>
<li><a href="#sec-6">6. Possible solution</a>
<ul>
<li><a href="#sec-6-1">6.1. Forks</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Discussions of this problem across the web:</a></li>
</ul>
</div>
</div>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-46281730-1', 'yn.github.io');
  ga('send', 'pageview');

</script>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Disclaimer</h2>
<div class="outline-text-2" id="text-1">
<p>
I did read the excellent <a href="http://www.amazon.com/Programming-Environment-Addison-Wesley-Professional-Computing/dp/0321525949">Advanced Programming in the UNIX Environment</a> a few years ago, but I am far from an expert. In particular, I am sure that I am using a lot of the signal-related terminology imprecisely. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
If you are a Ruby shop running <a href="http://unicorn.bogomips.org/">Unicorn</a> and <a href="http://www.postgresql.org/">PostgreSQL</a>, you might have noticed that your zero-downtime deploys are broken. The visible symptom of this breakage is a large number of <code>PG::QueryCanceled</code> or <code>ActiveRecord::StatementInvalid</code> (with <code>PG::QueryCanceled</code> in the message field) exceptions in your error logs and visibly aborted requests to your users. This is happening on every deploy, even though you have diligently read the Unicorn documentation and know that sending the USR2 signal to the Unicorn master will let all the Unicorn workers finish their current requests before exiting while the new master is bringing up new workers. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Ruby PostgreSQL gem change</h2>
<div class="outline-text-2" id="text-3">
<p>
On May 10th, 2013, <a href="https://github.com/ged/ruby-pg/commit/a4283c5c5b66ff4ecbb071965cf216e93d76a648">this commit</a> went into the Postgresql Ruby gem repository. On Jul 23rd, 2013, it was released, along with other changes, as version 0.16. From an architectural correctness point of view, this change is a good one: Ruby (in particular, we are talking about MRI 2.0.0) executes signal handlers on the main thread. Before version 0.16, executing <code> conn.exec("select&nbsp;pg_sleep(10)") </code> was a blocking call - if it was executing on the main thread, then no signal handlers could execute until <code>conn.exec</code> returned. In every-day terms, this means that pressing <code>Ctrl-C</code> while something on the main thread was performing a long-running action in PostgreSQL would have no effect until the SQL action completed, which is undesirable - what if the user was trying to interrupt the long-running action because it was dropping the "users" table?
</p>

<p>
In general, library code written in C has the option of being a good citizen and providing an unblocking function, or a "ubf" in Ruby terminology, that performs the necessary cleanup if a long-running, blocking-interrupts-by-default action is interrupted. This is explained in great detail in <a href="https://media.pragprog.com/titles/ruby3/ext_ruby.pdf">Extending Ruby 1.9 (pdf)</a>. The 0.16 and later versions of Ruby-PG gem include such an unblocking function. The implementation of that function follows:
<pre>
void ubf_cancel_running_command(void *c) {
  PGconn *conn = (PGconn*) c;
  PQrequestCancel(conn);
}
</pre>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Unicorn signals</h2>
<div class="outline-text-2" id="text-4">
<p>
Unicorn workers are single-threaded processes that execute the incoming request on the main thread. The Unicorn master, when it receives a USR2 signal starts sending the workers the QUIT signal. <a href="https://github.com/defunkt/unicorn/blob/v4.5.0/lib/unicorn/http_server.rb#L609-L653">Here</a> is the <code>worker_loop</code> method]] that has all the interesting stuff.
The QUIT signal handler for a Unicorn worker:
<pre>
trap(:QUIT) { worker = nil; LISTENERS.each { |s| s.close rescue nil }.clear }
</pre>
Some explanation: Unicorn workers all listen on the same socket, and each time a client connects, the kernel delivers the connection request to one of the workers. The Unicorn master sends a QUIT signal; if the worker is currently waiting for a request to come in, then the signal handler above runs, sets <code>worker</code> to <code>nil</code>, and closes the socket, which causes the <code>worker_loop</code>, and thus the whole process, to exit. If the worker is already in the middle of processing a request, but is not in the database layer, then the signal handler above runs, the request is resumed and finished, then the <code>worker_loop</code> exits.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Unicorn and PostgreSQL</h2>
<div class="outline-text-2" id="text-5">
<p>
Let's consider what happens when the worker is processing the request, and the execution is in the database layer. In order to run the QUIT signal handler, the database call is interrupted <b>and canceled</b>. The QUIT signal handler closes the socket and sets <code>worker</code> to <code>nil</code>, the request is resumed, but since the database call was canceled, a Ruby exception is thrown, and then the worker exits. 
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Possible solution</h2>
<div class="outline-text-2" id="text-6">
<p>
One possible solution is to downgrade to a pre-0.16 version of the ruby pg gem; however, this solution is not tenable long-term, as there are many other bug fixes that have accumulated over time. 
Let's review: the three components that interact here are:
</p>
<ol class="org-ol">
<li>Unicorn workers process requests on the main thread
</li>
<li>Ruby always delivers signals to the main thread and interrupts it
</li>
<li>The ruby pg gem says that if it is interrupted, it will cancel the ongoing database action.
</li>
</ol>
<p>
It doesn't seem like (2) is configurable, and (3) is useful in some cases. There doesn't seem to be any particular reason for why the <code>worker_loop</code> of a Unicorn worker process must be executing on the main Ruby thread. Indeed, in our internal tests, patching <code>worker_loop</code> to run in a separate thread, and having the main thread join it, solved the problem.
</p>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Forks</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Our Unicorn fork is located <a href="https://github.com/yn/unicorn">here</a>. Note that this is on the thread_hack branch, rather than on master. The commit of interest is <a href="https://github.com/yn/unicorn/commit/5fe54c46c57128533058506f8785f269f2c3fe57">here</a>. We also released a renamed version of this gem <a href="https://rubygems.org/gems/unicorn-academia">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Discussions of this problem across the web:</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><a href="https://groups.google.com/forum/#!topic/ruby-pg/5_ylGmog1S4">https://groups.google.com/forum/#!topic/ruby-pg/5_ylGmog1S4</a>
</li>
<li><a href="http://rubyforge.org/pipermail/mongrel-unicorn/2013-December/001974.html">http://rubyforge.org/pipermail/mongrel-unicorn/2013-December/001974.html</a>
</li>
<li><a href="http://article.gmane.org/gmane.comp.lang.ruby.unicorn.general/1936">http://article.gmane.org/gmane.comp.lang.ruby.unicorn.general/1936</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yuri Niyazov</p>
<p class="date">Created: 2013-12-06 Fri 23:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
